[
  {
    "type": "album",
    "url": "http://www.generasia.com/wiki/Game_(Perfume_album)",
    "title": "GAME",
    "date": "2008.04.16",
    "description": "GAME is Perfume's first album. It was released in two versions: a limited CD+DVD edition and a regular CD only edition. It is certified Double Platinum for the shipment of 500,000 albums.",
    "tracks": [
      "Polyrhythm (ポリリズム)",
      "plastic smile",
      "GAME",
      "Baby cruising Love",
      "Chocolate Disco (チョコレイト・ディスコ)",
      "Macaroni (マカロニ)",
      "Ceramic Girl (セラミックガール)",
      "Take me Take me",
      "Secret Secret (シークレットシークレット)",
      "Butterfly",
      "Twinkle Snow Powdery Snow",
      "Puppy love"
    ]
  },
  {
    "type": "album",
    "url": "http://www.generasia.com/wiki/Triangle_(Perfume)",
    "title": "⊿",
    "date": "2009.07.08",
    "description": "⊿ (Triangle) is Perfume's third album. It was released in two versions: a limited CD+DVD edition and a regular CD only edition. It was the #20 best-selling album of 2009.",
    "tracks": [
      "Take off",
      "love the world",
      "Dream Fighter",
      "edge (⊿-mix)",
      "NIGHT FLIGHT",
      "Kiss and Music",
      "Zero Gravity",
      "I still love U",
      "The best thing",
      "Speed of Sound",
      "One Room Disco (ワンルーム・ディスコ)",
      "Negai (Album-mix) (願い; Wish)"
    ]
  },
  {
    "type": "album",
    "url": "http://www.generasia.com/wiki/JPN",
    "title": "JPN",
    "date": "2011.11.30",
    "description": "JPN is the fourth album released by Perfume. It was released in two versions: a limited CD+DVD edition and a regular CD only edition. This album contains the singles \"Fushizen na Girl / Natural ni Koishite\", \"VOICE\", \"Nee\", \"Laser Beam / Kasuka na Kaori\" and \"Spice\". The limited edition of the album came housed in a slipcase. Fushizen na Girl is also remixed slightly on the album in the same way Laser Beam and GLITTER have been, however it hasn't been listed as such on the tracklist. The album took the #1 spot in the Oricon Weekly Chart of its release making Perfume the first girl group to have 3 consecutive #1 album releases since SPEED.\nIt is certified Platinum for the shipment of 250,000 albums.",
    "tracks": [
      "The Opening",
      "Laser Beam (Album-mix) (レーザービーム)",
      "GLITTER (Album-mix)",
      "Natural ni Koishite (ナチュラルに恋して; Fall in Love Naturally)",
      "MY COLOR",
      "Toki no Hari (時の針; Needle of Time)",
      "Nee (ねぇ; Hey)",
      "Kasuka na Kaori (微かなカオリ; Faint Scent)",
      "575",
      "VOICE",
      "Kokoro no Sports (心のスポーツ; Heart's Sports)",
      "Have a Stroll",
      "Fushizen na Girl (不自然なガール; Artificial Girl)",
      "Spice (スパイス)"
    ]
  },
  {
    "type": "album",
    "url": "http://www.generasia.com/wiki/Level3",
    "title": "LEVEL3",
    "date": "2013.10.02",
    "description": "LEVEL3 is the fifth album released by Perfume. It was released in two versions: a limited CD+DVD edition and a regular CD only edition. The limited edition came housed in one of 3 special color cases (clear, fluorescent pink or fluorescent yellow).",
    "tracks": [
      "Enter the Sphere",
      "Spring of Life (Album-mix)",
      "Magic of Love (Album-mix)",
      "Clockwork",
      "1mm",
      "Mirai no Museum (未来のミュージアム; Museum of the Future)",
      "Party Maker",
      "Furikaeru to Iru yo (ふりかえるといるよ; I'll Have to Look Back)",
      "Point (ポイント)",
      "Daijo Banai (だいじょばない; I'm Not Ok)",
      "Handy Man",
      "Sleeping Beauty",
      "Spending all my time (Album-mix)",
      "Dream Land",
      "Spending all my time (Radio Mix) (Re-release bonus track)",
      "Spending all my time (DV&LM remix) (Re-release bonus track)"
    ]
  },
  {
    "type": "album",
    "url": "http://www.generasia.com/wiki/Perfume_%7EComplete_Best%7E",
    "title": "Perfume ~Complete Best~",
    "date": "2006.08.02 (Limited Edition)",
    "description": "Perfume ~Complete Best~ is a best album and also Perfume's first album. It is a compilation of all of their singles (and a few of the B-sides) up to Electro World, not including their two Hiroshima limited singles before being produced by Nakata Yasutaka. There's only one new song on this album, \"Perfect Star Perfect Style\". It also comes with a DVD that includes four PVs.",
    "tracks": [
      "Perfect Star Perfect Style (パーフェクトスター・パーフェクトスタイル)",
      "Linear Motor Girl (リニアモーターガール)",
      "Computer City (コンピューターシティ)",
      "Electro World (Album Version) (エレクトロ・ワールド)",
      "Inryoku (引力; Gravity)",
      "Monochrome Effect (モノクロームエフェクト)",
      "Vitamin Drop (ビタミンドロップ)",
      "Sweet Donuts (スウィートドーナッツ)",
      "Foundation (ファンデーション)",
      "Computer Driving (コンピュータードライビング)",
      "Perfume",
      "wonder2"
    ]
  },
  {
    "type": "album",
    "url": "http://www.generasia.com/wiki/Perfume_Global_Compilation_%22Love_the_World%22",
    "title": "Perfume Global Compilation \"LOVE THE WORLD\"",
    "date": "2012.09.12",
    "description": "Perfume Global Compilation \"LOVE THE WORLD\" is the second best album released by Perfume. It was released in two versions: a limited CD+DVD edition and a regular CD only edition.",
    "tracks": [
      "Polyrhythm (ポリリズム)",
      "edge (⊿-mix)",
      "love the world",
      "Electro World (エレクトロ・ワールド)",
      "Chocolate Disco (2012-Mix) (チョコレイト・ディスコ)",
      "SEVENTH HEAVEN",
      "GAME",
      "Secret Secret (シークレットシークレット)",
      "NIGHT FLIGHT",
      "Baby cruising Love",
      "Butterfly",
      "FAKE IT",
      "Laser Beam (レーザービーム)",
      "GLITTER",
      "MY COLOR (LTW-Mix)",
      "Dream Fighter"
    ]
  },
  {
    "type": "single",
    "url": "http://www.generasia.com/wiki/Omajinai_Perori",
    "title": "OMAJINAI★Perori (OMAJINAI★ペロリ; Good Luck Charm)",
    "date": "2002.03.21",
    "description": "OMAJINAI★Perori is Perfume's debut single. It was sold in limited quantities in the group's hometown of Hiroshima. Originally ¥500, the single now goes for around ¥40,000 (around $400) on auction websites. Unlike their releases after being produced by Nakata Yasutaka, this single is completely void of the electronica Perfume is known for today; instead, favoring the sound of idol pop."
  },
  {
    "type": "single",
    "url": "http://www.generasia.com/wiki/Kareshi_Boshuuchuu",
    "title": "Kareshi Boshuuchuu (彼氏募集中; Recruiting a Boyfriend)",
    "date": "2002.11.01",
    "description": "Kareshi Boshuuchuu is Perfume's second single and their last before being produced by Nakata Yasutaka. Like their first single, Kareshi Boshuuchuu was sold in limited quantities in the group's hometown of Hiroshima. Originally ¥500, the single now goes for around ¥40,000 (around $400) on auction websites. Unlike their releases after being produced by Nakata Yasutaka, this single is completely void of the electronica Perfume is known for today; instead, favoring the sound of idol pop."
  },
  {
    "type": "single",
    "url": "http://www.generasia.com/wiki/Sweet_Donuts",
    "title": "Sweet Donuts (スウィートドーナッツ)",
    "date": "2003.08.06",
    "description": "Sweet Donuts is Perfume's first single after being signed to BEE-HIVE RECORDS, and third overall. It is also their first single in which they were produced by Nakata Yasutaka. Since their 2005 major debut, the single has been incredibly hard to find and can be found on auction sites for more than double its original price. In February 2008, the single was re-released and included in the \"Fan Service ~Prima Box~\" CD+DVD boxset."
  },
  {
    "type": "single",
    "url": "http://www.generasia.com/wiki/Monochrome_Effect",
    "title": "Monochrome Effect (モノクロームエフェクト)",
    "date": "2004.03.17",
    "description": "Monochrome Effect is Perfume's second single after being signed to BEE-HIVE RECORDS, and fourth overall. Since their 2005 major debut, the single has gone out of print and is incredibly hard to find. It can be found on auction sites for more than five times its original price. In February 2008, the single was re-released with a new cover and included in the \"Fan Service ~Prima Box~\" CD+DVD boxset."
  },
  {
    "type": "single",
    "url": "http://www.generasia.com/wiki/Vitamin_Drop",
    "title": "Vitamin Drop (ビタミンドロップ)",
    "date": "2004.09.08",
    "description": "Vitamin Drop is Perfume's third single after being signed to BEE-HIVE RECORDS, and fifth overall. It is their last single before being signed to Tokuma Japan. Since their 2005 major debut, the single has been incredibly hard to find and can be found on auction sites for more than double its original price. On Amazon Japan, used copies sell for nearly ¥10,000 (nearly $100). In February 2008, the single was re-released and included in the \"Fan Service ~Prima Box~\" CD+DVD boxset."
  },
  {
    "type": "single",
    "url": "http://www.generasia.com/wiki/Linear_Motor_Girl",
    "title": "Linear Motor Girl (リニアモーターガール)",
    "date": "2005.09.21",
    "description": "Linear Motor Girl is Perfume's debut major single and their sixth single overall. First pressing included a trading card of one of the group's members. The single started was the start of their more electro feel to their music. This single reached #99 on the Oricon charts, charted for four weeks and sold 2,630 copies."
  },
  {
    "type": "single",
    "url": "http://www.generasia.com/wiki/Computer_City",
    "title": "Computer City (コンピューターシティ)",
    "date": "2006.01.11",
    "description": "Computer City is Perfume's second major single and seventh overall. First pressing included a trading card of one of the group's members. This single reached #45 on the Oricon charts, charted for five weeks and sold 3,841 copies."
  },
  {
    "type": "single",
    "url": "http://www.generasia.com/wiki/Electro_World",
    "title": "Electro World (エレクトロ・ワールド)",
    "date": "2006.06.28",
    "description": "Electro World is Perfume's third major single and eighth overall. First pressing a trading card featuring  one of the group's members. This single reached #77 on the Oricon charts, charted for two weeks and sold 1,989 copies."
  },
  {
    "type": "single",
    "url": "http://www.generasia.com/wiki/Fan_Service_(Sweet)",
    "title": "Fan Service [sweet] (ファン・サーヴィス [sweet])",
    "date": "2007.02.14",
    "description": "Fan Service [sweet] is Perfume's fourth major single; and ninth overall. It includes a CD and DVD with the PVs for the two songs included on the single. The single came in a special box package and a 20-page photobook is also included. This single debuted at number 20 on Oricon daily charts, a first for Perfume to reach the top 20. It reached #31 on the weekly charts, charted for nine weeks and sold 9,124 copies. The single is now out of print and new copies can fetch a price of up to ¥20,000 ($200). When the booklet included in the single is flipped backwards and inserted, the pattern on the front of the box becomes rainbow patterned"
  },
  {
    "type": "single",
    "url": "http://www.generasia.com/wiki/Polyrhythm",
    "title": "Polyrhythm (ポリリズム)",
    "date": "2007.09.12",
    "description": "Polyrhythm is Perfume's fifth major label single, and tenth overall. The title track was used as the NHK Kankyou Recycle Campaign Song. The single was released in a limited edition CD+DVD version (which includes the music video for Polyrhythm) as well as a CD only regular edition. This was Perfume's first single to be released in more than one edition. The limited edition is out of print and can fetch prices upwards of ¥10,000 ($100)."
  },
  {
    "type": "single",
    "url": "http://www.generasia.com/wiki/Baby_Cruising_Love_/_Macaroni",
    "title": "Baby cruising Love / Macaroni (マカロニ)",
    "date": "2008.01.16",
    "description": "Baby cruising Love / Macaroni is Perfume's sixth major label single, and eleventh overall. It was released in two versions: a limited CD+DVD edition and a regular CD only edition. It was also their first double a-side single. 150 first press copies of the single were signed by one of the 3 members. Those who received autographed copies were automatically entered in a drawing for backstage passes at Perfume's Shibuya AX concert on February 12, 2008. 100,000 first press copies came with application forms with which purchasers could enter a drawing. Perfume would go to the winner's home and take pictures with them. This was the first time a Japanese artist had ever done a promotion event like this."
  },
  {
    "type": "single",
    "url": "http://www.generasia.com/wiki/Love_the_World",
    "title": "love the world",
    "date": "2008.07.09",
    "description": "love the world is Perfume's seventh major single. It was released in two versions: a limited CD+DVD edition and a regular CD only edition. The limited edition's booklet is also a foldout poster. The artwork of the limited edition is printed on paper that is embossed with triangular patterns. love the world is Perfume's first single to reach #1 on the Oricon charts. It is the first technopop song to reach #1 in the history of the Oricon charts, and it is also the group's best selling single to date. The single is certified Gold for the shipment of 100,000 singles."
  },
  {
    "type": "single",
    "url": "http://www.generasia.com/wiki/Dream_Fighter",
    "title": "Dream Fighter",
    "date": "2008.11.19",
    "description": "Dream Fighter is Perfume's eighth major label single, and thirteenth overall. The single was released in two versions: a limited CD+DVD edition and a regular CD only edition. The artwork of this single is printed on paper with a metallic shimmer finish. The single is certified Gold for the shipment of 100,000 copies. The title track is also certified Gold for 100,000 units downloaded."
  },
  {
    "type": "single",
    "url": "http://www.generasia.com/wiki/One_Room_Disco",
    "title": "One Room Disco (ワンルーム・ディスコ)",
    "date": "2009.03.25",
    "description": "\"One Room Disco\" is the 14th and ninth major single released by Perfume. It was released in two different versions: a limited CD+DVD edition and a regular CD only edition. When the limited edition's cover is held at an angle in the light, ribbons of rainbow become visible across the artwork.\nThe single is certified Gold for the shipment of 100,000 copies. The title track is also certified Gold for 100,000 units downloaded."
  },
  {
    "type": "single",
    "url": "http://www.generasia.com/wiki/Fushizen_na_Girl_/_Natural_ni_Koishite",
    "title": "Fushizen na Girl / Natural ni Koishite (不自然なガール / ナチュラルに恋して)",
    "date": "2010.04.14",
    "description": "\"Fushizen na Girl / Natural ni Koishite\" is the 10th major and 15th overall single released by Perfume. It was released in two versions: a limited CD+DVD edition and a regular CD only edition. The limited edition comes with a DVD of the first A-side's PV. \"Natural ni Koishite\" was used as the NATURAL BEAUTY BASIC commercial song. The limited edition's booklet is printed on special paper that when held in the light, reveals geometric shapes."
  },
  {
    "type": "single",
    "url": "http://www.generasia.com/wiki/Voice_(Perfume)",
    "title": "VOICE",
    "date": "2010.08.11",
    "description": "\"VOICE\" is the 11th major and 16th overall single released by Perfume. It was released in two versions: a limited CD+DVD edition and a regular CD only edition. The limited edition comes with a DVD that contains the PV for \"VOICE\". The CD artwork for the limited edition was printed on paper with a metallic shimmer finish, similar to that of \"Dream Fighter\". \"VOICE\" was used as the \"Nissan no Omise de!\" Campaign commercial song and \"575\" was used as the KDDI \"iida\" commercial song. \nThe single is certified Gold for the shipment of 100,000 copies, and both title tracks (VOICE and 575) are certified Gold for 100,000 units downloaded."
  },
  {
    "type": "single",
    "url": "http://www.generasia.com/wiki/Nee_(Perfume)",
    "title": "Nee (ねぇ)",
    "date": "2010.11.10",
    "description": "\"Nee\" is the 12th major label and 17th overall single released by Perfume. It was released in two versions: a limited CD+DVD edition that comes with a DVD of the title song's PV, and a regular CD only edition. The limited edition came with a special accordion fold booklet that can be rearranged so that there are several possible cover images. Artwork of the limited edition was printed on scented paper. The titular track was used in a commercial for NATURAL BEAUTY BASIC. It is their second song to be used in a commerical for the company, the first of which was \"Natural ni Koishite\", the second A-side of their 15th single \"Fushizen na Girl / Natural ni Koishite\".\nThe single is certified Gold for the shipment of 100,000 copies."
  },
  {
    "type": "single",
    "url": "http://www.generasia.com/wiki/Laser_Beam_/_Kasuka_na_Kaori",
    "title": "Laser Beam / Kasuka na Kaori (レーザービーム / 微かなカオリ)",
    "date": "2011.05.18",
    "description": "\"Laser Beam / Kasuka na Kaori\" is the 13th major label and 18th overall single released by Perfume. It was released in two versions: a limited CD+DVD edition that comes with a DVD of the short version of the \"Laser Beam\"'s PV and a making of clip of the single's jackets, and a regular CD only edition. The limited edition comes packaged in a special cardboard slipcase, a first for the group's releases. First pressings of the single came with a B2 promotional poster (also a first). \"Laser Beam\" was used in a commercial for Kirin Chuuhai Hyouketsu."
  },
  {
    "type": "single",
    "url": "http://www.generasia.com/wiki/Spice_(Perfume)",
    "title": "Spice (スパイス)",
    "date": "2011.11.02",
    "description": "\"Spice\" is the 19th single (14th major label single) released by Perfume. It was released in two versions: a limited CD+DVD edition that comes with a DVD, and a regular CD only edition. The title track was used as the theme song for the drama Sengyoshufu Tantei. \"GLITTER\" was used as the commercial song for \"KIRIN\".\nIt is certified Gold for the shipment of 100,000 CDs."
  },
  {
    "type": "single",
    "url": "http://www.generasia.com/wiki/Spring_of_Life_(Perfume)",
    "title": "Spring of Life",
    "date": "2012.04.11",
    "description": "\"Spring of Life\" is the 20th single (15th major label single) released by Perfume. It was released in two versions: a limited CD+DVD edition that comes with a DVD, and a regular CD only edition. The limited edition comes housed in a slipcase. First pressings of both versions came with a B2 promotional poster. This is their first single under Universal Music Japan. The title track was used as the commercial song for \"KIRIN\". The B-side, \"Communication\" was used as the commercial song for KANRO Pure Gummy.\n\n\nIt is certified Gold for the shipment of 100,000 CDs."
  },
  {
    "type": "single",
    "url": "http://www.generasia.com/wiki/Spending_All_My_Time",
    "title": "Spending all my time",
    "date": "2012.08.15",
    "description": "\"Spending all my time\" is the 21st single (16th major label single) released by Perfume. It was released in two versions: a limited CD+DVD edition, and a regular CD only edition. This is their first single under their own Universal Music Japan sub-label Perfume Records. The first B-side \"Point\" was used as the commercial song for \"KIRIN Chuhai Hyoketsu\". The second B-side, \"Hurly Burly\" was used as the commercial song for \"KIRIN Chuhai Hyoketsu Yasashii Kajitsu no 3%\". Both versions include a B2-size poster."
  },
  {
    "type": "single",
    "url": "http://www.generasia.com/wiki/Mirai_no_Museum",
    "title": "Mirai no Museum (未来のミュージアム; Museum of the Future)",
    "date": "2013.02.27",
    "description": "\"Mirai no Museum\" is the 22nd single (17th major label single) released by Perfume. It was released in two versions: a limited CD+DVD edition, and a regular CD only edition. The title track was used as the theme song to the animated movie Nobita no Himitsu Dougu Hakubutsukan (Museum) and as the ending theme song for its anime version."
  },
  {
    "type": "single",
    "url": "http://www.generasia.com/wiki/Magic_of_Love_(Perfume)",
    "title": "Magic of Love",
    "date": "2013.05.22",
    "description": "\"Magic of Love\" is the 23rd single (18th major label single) released by Perfume. It was released in two versions: a limited CD+DVD edition, and a regular CD only edition. The title track was used as Kanro's Pure Gummy commercial song and as the theme song for the TV program Sukkiri!."
  },
  {
    "type": "single",
    "url": "http://www.generasia.com/wiki/Sweet_Refrain",
    "title": "Sweet Refrain (Drama Ver.)\n Sweet Refrain",
    "date": "2013.10.12\n 2013.11.27",
    "description": "\"Sweet Refrain (Drama Ver.)\" is the 3rd digital single released by Perfume."
  },
  {
    "type": "single",
    "url": "http://www.generasia.com/wiki/Cling_Cling",
    "title": "Cling Cling",
    "date": "2014.07.02 (Digital single)",
    "description": "\"Cling Cling\" is the 25th single (20th major label single) released by Perfume and their 5th digital single. It was released in three versions: a limited first press CD+DVD+Photobook edition, a limited CD+DVD edition, and a regular CD only edition which would be available after the limited editions have been sold. The title track was used as the CM song for \"Chocola BB.\""
  },
  {
    "type": "single",
    "url": "http://www.generasia.com/wiki/Relax_in_the_City_/_Pick_Me_Up",
    "title": "Relax In The City / Pick Me Up",
    "date": "2015.04.29",
    "description": "\"Relax In The City / Pick Me Up\" is the 26th (21st major label) single released by Perfume. The single was released in three versions: a limited first press CD+DVD edition, a limited CD+DVD edition, and a regular CD only edition which was made available after the limited editions sold out. The first press edition comes with a \"Relax Room\" cubic box packaging and a 40-page photo booklet, while the limited edition of the single comes in a slipcase cover and a 16-page photo booklet. \"Relax In The City\" was used as the CM song for Sapporo Green Aroma. \"Pick Me Up\" was part of a tie-in with upscale Japanese department store chain Isetan which Perfume also released special dance heels and accessories through. \"Toumei Ningen\" was used as a CM song for Chocola BB."
  },
  {
    "type": "single",
    "url": "http://www.generasia.com/wiki/Star_Train",
    "title": "STAR TRAIN",
    "date": "2015.10.28",
    "description": "\"STAR TRAIN\" is the 27th (22nd major label) single released by Perfume. The single was released in two versions: a limited CD+DVD edition and a regular CD only edition. The title track was used as the theme song for their documentary \"WE ARE PERFUME -WORLD TOUR 3rd DOCUMENT-\", while \"TOKIMEKI LIGHTS\" was used as a CM song for Chocola BB."
  }
]